/*
 * Lesson_14_2.c
 *
 * Created: 18.10.2021 21:30:29
 * Author : Дмитрий
 */ 

#define F_CPU 1000000UL
#include <avr/io.h>
#include <util/delay.h>
#include <avr/interrupt.h>

int r1_1000 = 0;
int r2_100 = 0;
int r3_10 = 0;
int r4_1 = 0;

int z=0;

int seconds = 0;

void digits (int z)
{
	PORTB &= ~((1<<3) | (1<<2) | (1<<1) | (1<<0));
	PORTD &= ~((1<<3) | (1<<2) | (1<<1) | (1<<0));
	
	switch(z)
	{
		case 0: PORTB |= (1<<3)|(1<<2)|(1<<1)|(1<<0);PORTD |= (1<<1)|(1<<0);break; // 0
		case 1: PORTB |= (1<<2) | (1<<1); break; // 1
	}
}



void chislo (unsigned int vse_chislo)
{
	
	
	r1_1000 = vse_chislo/1000;		// Тысячи
	r2_100 = vse_chislo%1000/100;	// Сотни
	r3_10 = vse_chislo%100/10;		// Десятки
	r4_1 = vse_chislo%10;			// Единицы
}

ISR(TIMER0_OVF_vect)
{
	//TCNT0 = 128;
	z++;
	if(z>4) z=1;
	if (z==1)
	{
		PORTD |= (1<<5) | (1<<4);
		PORTB |= (1<<5); // ВЫКЛючаем 2-й, 3-й и 4-й разряды
		PORTB &= ~(1<<4);		  // ВКЛЮчаем 1-й разряд
		
		digits(r1_1000); // Отображаем тысячи
	}
	else if (z==2)
	{
		
		PORTD |= (1<<5) | (1<<4);
		PORTB |= (1<<4); // ВЫКЛючаем 1-й, 3-й и 4-й разряды
		PORTB &= ~(1<<5);		  // ВКЛЮчаем 2-й разряд
		
		digits(r2_100); // Отображаем сотни
		
	}
	else if (z==3)
	{
		PORTB |= (1<<5) | (1<<4);
		PORTD |= (1<<5); // ВЫКЛючаем 1-й, 2-й и 4-й разряды
		PORTD &= ~(1<<4);		  // ВКЛЮчаем 3-й разряд
		
		digits(r3_10);
		
	}
	else if (z==4)
	{
		PORTB |= (1<<5) | (1<<4);
		PORTD |= (1<<4); // ВЫКЛючаем 1-й, 2-й и 3-й разряды
		PORTD &= ~(1<<5);	  // ВКЛЮчаем 4-й разряд
		
		digits(r4_1); // Отображаем единицы
	}
	
	
}


int main(void)
{
	// Сегменты a,b,c,d	
	DDRB |= (1<<3) | (1<<2) | (1<<1) | (1<<0);
	PORTB &= ~((1<<3) | (1<<2) | (1<<1) | (1<<0));
	
	// Сегменты e,f,g,dp	
	DDRD |= (1<<3) | (1<<2) | (1<<1) | (1<<0);
	PORTD &= ~((1<<3) | (1<<2) | (1<<1) | (1<<0));
	
	//Разряды 1,2
	DDRB |= (1<<5) | (1<<4);
	PORTB |= (1<<5) | (1<<4);
	
	//Разряды 3,4
	DDRD |= (1<<5) | (1<<4);
	PORTD |= (1<<5) | (1<<4);
	
	
	TCCR0 = 0b00000010;
	TIMSK |= (1<<TOIE0);

	
	sei();
	

	while (1)
	{
		chislo(0011);
	}
}

